#include<iostream>
using namespace std;

//数组：就是一个集合，
//特点1：数组中的每个数据元素都是相同的数据类型
//特点2：数组是有连续的内存位置组成 
/*一维数组定义的三种方式
* 1.数据类型 数组名[数组长度]
* 2.数据类型 数组名[数组长度]={值1,值2...}
* 3.数据类型 数组名[]={值1,值2...}
*/

int main1() {

	////1.数据类型 数组名[数组长度]
	//int arr[5];
	////数组元素的下标是从0开始索引的
	//arr[0] = 10;
	//arr[1] = 20;
	//arr[2] = 30;
	//arr[3] = 40;
	//arr[4] = 50;

	////访问数据元素
	//cout << arr[0] << endl;

	//2.数据类型 数组名[数组长度]={值1,值2...}
	//如果在初始化数据的时候，没有全部填写完，会用0来填补
	//int arr2[5] = { 10,20,30,40,50 };
	//cout << arr2[0] << endl;
	//利用for循环输出数组中的元素
	/*for (int i = 0; i < 5; i++)
	{
		cout << arr2[i] << endl;
	}*/

	// 3.数据类型 数组名[]={值1,值2...}
	//定义数组的时候，必须有初始长度
	int arr3[] = { 90,80,70,60,50,40,30,20,10 };
	for (int j = 0; j < 9; j++)
	{
		cout << arr3[j] << endl;
	}

	system("pause");

	return 0;
}